app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "homeless_people".* FROM "homeless_people" WHERE "homeless_people"."city_id" = $1  [["city_id", 1]]
---
  def show
    @user = User.new
    @city = City.find(params[:id])
    @homeless = @city.homeless_people
    response = HTTParty.get("http://api.openweathermap.org/data/2.5/weather?q=#{@city.name}")