app/controllers/homeless_people_controller.rb

  def index
    @users = User.all
    @user = @users.last
    @user_name = @user.name.capitalize
    @city = City.find(params[:city_id]) #find the question
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 2]]