app/controllers/homeless_people_controller.rb

  def show #show view must be exist for this to work
    @city = City.find(params[:city_id, :id]) #find the question
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 0]]